{
    "name": "Collagen Booster with Hyaluronic Acid & Resveratrol  (60 Capsules)",
    "brand": "Reserveage Nutrition",
    "price": "42.99",
    "images": [
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_01?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_02?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_03?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_04?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_06?$OP_PDPZOOM$"
    ],
    "thumbnails": [
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_01?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_02?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_03?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_04?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703594_06?$OP_PLP$"
    ],
    "description": "<p><b>Collagen Booster with Hyaluronic Acid &amp; Resveratrol<\/b><\/p><ul><li>Radiant Skin and Healthy Joint Support*<\/li><li>Highly Bioavailable Hyaluronic Acid Supports Hydration*<\/li><li>Patented Ingredient<\/li><li>Studied Clinically Ingredients<\/li><li>Tested Gluten Free<\/li><li>No Unnecessary Fillers or Additives<\/li><\/ul><p><b>Biocell Collagen<\/b><\/p><p>Patented, high quality, traceable ingredient for supporting collagen sythesis.*<\/p><p><b>Hyaluronic Acid<\/b><\/p><p>A component found naturally in skin that supports hydration.*<\/p><p><b>Pro-Longevity Factors&reg; Blend<\/b><\/p><p>Our proprietary antioxidant blend provides cellular protection.*<\/p><p>**These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent disease.<\/p><p> <\/p>",
    "feature": "Gluten Free,Keto,Paleo Friendly",
    "serving": "2 Capsules",
    "strength": "",
    "weight": "9",
    "weightType": "OZ",
    "upc": "094922978646",
    "numberOfServings": 30,
    "type": "",
    "form": "Capsules",
    "target": "",
    "ingredients": [
        {
            "ingredentDetails": "(PROPRIETARY CHICKEN STRENAL CARTILAGE EXTRACT) HYDROLYZED COLLAGEN TYPE II 600 MG, CHONDROITIN SULFATE 200 MG, HYALURONIC ACID 100 MG",
            "rdaPercnt": "*",
            "ingredentName": "BIOCELL COLLAGEN(R)",
            "unts": "MG",
            "amtContained": "1000",
            "sortOrder": "1"
        },
        {
            "ingredentDetails": "WILDCRAFTED JAPANESE KNOTWEED EXTRACT (POLYGONUM CUSPIDATUM) (ROOT AND RHIZOME) (STANDARDIZED TO CONTAIN 100 MG OF TRANS-RESVERATROL), ORGANIC FRENCH WHOLE RED WINE GRAPE (VITIS VINIFERA) (SKIN, SEEDS, FRUIT, STEM, VINE), CERTIFIED ORGANIC MUSCADINE WHOLE RED GRAPE (VITIS ROTUNDIFOLIA) (SKIN AND SEED)",
            "rdaPercnt": "*",
            "ingredentName": "PRO-LONGEVITY FACTORS(R) BLEND:",
            "unts": "MG",
            "amtContained": "400",
            "sortOrder": "2"
        }
    ],
    "otherIngredients": " Vegetarian capsule (vegetable cellulose), rice brand, silica.",
    "directions": " As a dietary supplement, take 2 capsules daily. For intensive use or joint support, take 1 serving twice. Product can be taken as recommended by your healthcare practitioner. Best if stored tightly in a cool, dry place.",
    "warnings": " Please consult your healthcare professional before taking this product, especially if you are pregnant, nursing, on medication or under a doctor's care. KEEP OUT OF REACH OF CHILDREN AND PETS. DO NOT USE IF OUT SEAL IS BROKEN OR MISSING.",
    "allrgens": "",
    "notContains": "",
    "category": "Vitamins & Supplements",
    "subCategory1": "Supplements",
    "subCategory2": "Collagen",
    "reviews": {
        "230492": {
            "id": 230492,
            "text": "I have very dry skin, I noticed a big improvement on my skin, softer less dry since taking this product. Love it!",
            "title": "great product",
            "dateCreatedFormatted": "Nov 8, 2020",
            "purchaseDateFormatted": "Oct 8, 2020",
            "name": "Lidia D"
        },
        "158685": {
            "id": 158685,
            "text": "I like this product, I feel like in using for a few months that my skin looks a little fresher. It’s a good product",
            "title": "Good product",
            "dateCreatedFormatted": "Oct 25, 2018",
            "purchaseDateFormatted": "Oct 9, 2018",
            "name": "Rachel R"
        },
        "141821": {
            "id": 141821,
            "text": "I started using this about a year ago because I’m 36 and not getting any younger so I want to take care of my skin. I use to go to tanning beds and lay out because tanned skin was considered beautiful. Well now I’m more concerned about wrinkles and looking younger. Well it is actually taking off the damaged skin and it does look like I have brown spots on my skin where the skin has not cleared yet but that tells me it’s working. The spots where  the damaged skin has already disappeared is so silky and white. So I know in a few months my skin will be clear and soft. The sun damage will be gone and I will never go without sunscreen. This definitely beats the cost of a dermatologist.",
            "title": "Best product Ever For Skin!!!",
            "dateCreatedFormatted": "Jun 30, 2018",
            "purchaseDateFormatted": "",
            "name": "Natalie N"
        },
        "121903": {
            "id": 121903,
            "text": "Good product Reserveage Organics that  I have been taking for several months has improved the appearance of my skin and hair. <br \/>This last Packaging I received was colored in pink not Purple and does not say Reserveage Organics..    It says Reserveage nutrition. <br \/> Is this the same product ? Change in packaging? <br \/> As I read Supplemental Facts only thing I see listed as Organic is the Red Wine Grapes, Please clarify this.",
            "title": "This is a good product!",
            "dateCreatedFormatted": "Dec 5, 2016",
            "purchaseDateFormatted": "",
            "name": "Christine C"
        },
        "121907": {
            "id": 121907,
            "text": "I used Collagen Booster consistently for a year with great results as far as skin and such as well as fluid of movement\/ less body stiffness.  I stopped for 4 months due to budget constraints and immediately felt the difference.  Recently I started battling painful dry\/burning\/itchy EYELIDS and tried organic olive oil, coconut oil, vitamin E oil, honey...stopped using all topical lotions and makeup with NO relief.  My budget eased and I bought a  bottle of Collagen Booster and IMMEDIATELY FELT RELIEF within a few days.  I will make a point of fitting it in and I recommend it to all my friends.  Quality of life restored!",
            "title": "Cured Dry Painful Eyelids as well as helps with stiff joints",
            "dateCreatedFormatted": "Dec 28, 2015",
            "purchaseDateFormatted": "",
            "name": "no more dry EYELIDS! n"
        },
        "121892": {
            "id": 121892,
            "text": "Will purchases again! !!",
            "title": "Very Health selection",
            "dateCreatedFormatted": "Nov 20, 2015",
            "purchaseDateFormatted": "",
            "name": "Pastor Delphine P"
        },
        "121893": {
            "id": 121893,
            "text": "Glad to find a supplement to compliment my investment in Anti-Aging topical skin care. I noticed changes with skin plumpness immediately and have been reordering to maintain. I feel confident in the ingredients.",
            "title": "I keep reordering",
            "dateCreatedFormatted": "Jun 23, 2015",
            "purchaseDateFormatted": "",
            "name": "young as you feel y"
        },
        "121891": {
            "id": 121891,
            "text": "Hello,<br \/>I bought Reserveage Collagen several times and I really do like it very much.  However it is very expensive and the last time I bought about three <br \/>months ago it was a little more than half full.<br \/>It cost me $40.00.  I realize you need to make money but I need to save money and I think I should be able to get the most out of what I buy too as well.<br \/>I need not but this though your company but Reserveage is still the same company.  I would buy again if it is less and I do not want it be just slightly more than half full.",
            "title": "Reserveage Collagen",
            "dateCreatedFormatted": "Apr 9, 2014",
            "purchaseDateFormatted": "",
            "name": "no nick name n"
        },
        "121890": {
            "id": 121890,
            "text": "I have been taking two capsules, once per day for one month and I have noticed a HUGE difference in the moisture levels of my skin. I have always had extremely dry skin and, after the first week, I noticed less dryness. Now, after a month, I no longer need to use body lotions. My facial skin has become very supple and hydrated with no more need for topical moisturizers which almost always caused my T-zone to break out. Moisturizing from the inside out is the way to go! Also, it may be the hyaluronic acid; I am not sure. But I have noticed a decrease in the lower back pain I have always experienced first thing in the morning.",
            "title": "Great Skin Moisturizer!",
            "dateCreatedFormatted": "Mar 4, 2014",
            "purchaseDateFormatted": "",
            "name": "Sheila S"
        },
        "121904": {
            "id": 121904,
            "text": "I have been using this product for about 14 months now. I love it. I do notice a difference if I run out and don't buy for a week or two: my joints ache when I run, and my skin looks crepey. I take two per day (one in  morning and one in afternoon) and I have noticed a difference in how I feel and look with this product. Love it.",
            "title": "Great",
            "dateCreatedFormatted": "Jul 27, 2013",
            "purchaseDateFormatted": "",
            "name": "sarac34 s"
        },
        "121899": {
            "id": 121899,
            "text": "I originally bought this to see if it would help with the wrinkles on my face. I was pleased to see my skin looking a little smoother but also got a bonus with pain relief. I have had elbow tendonitis for over a year and it has really helped the pain.",
            "title": "Collagen Booster",
            "dateCreatedFormatted": "Jun 19, 2013",
            "purchaseDateFormatted": "",
            "name": "roni r"
        },
        "121902": {
            "id": 121902,
            "text": "I have reddish blonde hair, super fair,dry skin, and get freckles.  As I get older, the wrinkles and dryness have been totally disconcerting.  This product helps, taking 2 per day.  I ran out and noticed a big change, especially in skin hydration  All creams and lotions were useless.  I needed to work on the inside out.",
            "title": "helps my skin",
            "dateCreatedFormatted": "May 4, 2013",
            "purchaseDateFormatted": "",
            "name": "fair haired lady f"
        },
        "121900": {
            "id": 121900,
            "text": "I take several things to fight joint pain due to arthritis....turmeric, glucosamine, chondroitan, MSM, even ADVIL......the thing that works the best, by far, is this Collagen and Hyaluronic acid combination.  <br \/>I don't know what it is but it works for me and I am extremely grateful.<br \/>I don't know about improved skin or hair----but when it comes to joint pain, this stuff is great.<br \/>I've done my own *tests* regarding eliminating certain things at certain times so I have definitely narrowed it down to this particular product that is doing the job.",
            "title": "AWEWSOME!   FIVE STARS!",
            "dateCreatedFormatted": "Jan 17, 2013",
            "purchaseDateFormatted": "",
            "name": "Southern Woman S"
        },
        "121897": {
            "id": 121897,
            "text": "I've been studying and practicing natural health for +30 yrs. I got this for my shoulder joint\/tendon\/ligament issues. It surely helps in this area. I also noticed a huge difference in my facial skin tone. Its not a 'hydrating' action as previously suggested. Not all products are proper for all people. Just because one user had no affect is no reason to say its ineffective across the board. That's a very narrow way to view things. Oh, also my hair has grown several inches and gotten much healthier in the few months I've been using it.",
            "title": "Great Product",
            "dateCreatedFormatted": "Oct 11, 2012",
            "purchaseDateFormatted": "",
            "name": "bob b"
        },
        "121896": {
            "id": 121896,
            "text": "I tired this and saw no noticeable improvement :-(.  I'm guessing that people who saw results with this product had dry skin and this helped hydrate it?  On the up side there were no side effects - even taking 2 at a time did not upset my stomach which sometimes happens with supplements.",
            "title": "Really?",
            "dateCreatedFormatted": "Sep 26, 2012",
            "purchaseDateFormatted": "",
            "name": "Dee D"
        },
        "121894": {
            "id": 121894,
            "text": "I'm someone with rather sensitive skin, and have gone through many products in the quest for glamorously clear skin. I found what I was looking for in this right here. Paired with the right moisturizer (varying on your skin type), this fills your skin with a certain nourishment that a moisturizer alone lacks. For times when I'm having really bad skin days, I'll take four a day for a few days and my skin will return to perfect. Then two a day and a good diet keeps me looking radiant and picture perfect.",
            "title": "Great product.",
            "dateCreatedFormatted": "Sep 7, 2012",
            "purchaseDateFormatted": "",
            "name": "JBJB J"
        },
        "121908": {
            "id": 121908,
            "text": "I have been using this product for a short time, only two weeks BUT the difference is huge. My skin has taken on a much younger and healthier appearance. I am just finished placing an order for more of this product.",
            "title": "DR",
            "dateCreatedFormatted": "Mar 15, 2012",
            "purchaseDateFormatted": "",
            "name": "Debra R D"
        },
        "121888": {
            "id": 121888,
            "text": "My wife loves this stuff.  Her skin looks and feels so smooth.  I would recommend it...",
            "title": "Great Stuff",
            "dateCreatedFormatted": "Sep 4, 2011",
            "purchaseDateFormatted": "",
            "name": "Jean S J"
        },
        "121910": {
            "id": 121910,
            "text": "Love this Product,I have been using this product for a while and have enjoyed using it",
            "title": "Awesome Stuff",
            "dateCreatedFormatted": "Apr 29, 2011",
            "purchaseDateFormatted": "",
            "name": "Hemal1 S H"
        },
        "121889": {
            "id": 121889,
            "text": "I thought I would try this product to see if it would improve my skin texture.  I am 56 years old and my pores and wrinkles on my skin were becoming very noticable.  I thought it would probably take about three months to see any results, but I was so surprised to notice changes beginning at about three weeks.  I take it every night and I have just finished my first bottle and I will be buying another bottle tomorrow.  Now I am interested in the other products offered by this company.  I love to find something organic that works instead of using prescription products.",
            "title": "Surprised at quick results",
            "dateCreatedFormatted": "Nov 2, 2010",
            "purchaseDateFormatted": "",
            "name": "alicia j a"
        },
        "121906": {
            "id": 121906,
            "text": "Within a week, i could see changes in the texture of my skin: a smoother complexion and a slight glow. Not much difference in my hair growth. I am perimenopause, so an improvement might be more challenging. I stopped taking this for almost two weeks because i had surgery and just wasn't motivated and could tell the difference in my skin. I'm sold!",
            "title": "It actually seems to work",
            "dateCreatedFormatted": "Oct 20, 2010",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "121911": {
            "id": 121911,
            "text": "Of the times I did take this my skin did glow and I did feel beautiful. I don't take it as often as I should since I look young already. But it is worthy of a good review.",
            "title": "Glowing Skin",
            "dateCreatedFormatted": "Oct 10, 2010",
            "purchaseDateFormatted": "",
            "name": "Van N V"
        },
        "121901": {
            "id": 121901,
            "text": "i am 21 years old, so i am not worried about aging. but i wanted to try out this product because of the hyaluronic acid, which is supposed to increase skin hydration for dry, sensitive skin--there's similar options for it, but i thought all that red wine extract couldn't hurt either. well, it really does work! it's amazing! i've gone through almost a bottle so far (2 pills a day) and the skin skin on my face feels so much more soft, smooth and \"plump.\" i would recommend this to anyone and everyone. i have come to like this brand in general, so i would also recommend many of their other products.",
            "title": "this works",
            "dateCreatedFormatted": "Jul 30, 2010",
            "purchaseDateFormatted": "",
            "name": "Alexandra S A"
        },
        "121905": {
            "id": 121905,
            "text": "It's expensive but my hair is growing faster than ever. It's NOT a miracle cure for aging. I still have my same wrinkles but at least I don't have more wrinkles. I am on my 3rd bottle.",
            "title": "love it",
            "dateCreatedFormatted": "Apr 13, 2010",
            "purchaseDateFormatted": "",
            "name": "douglas d d"
        },
        "121898": {
            "id": 121898,
            "text": "Ellen's always been a looker and I'll love her no matter how many wrinkles she gets. But I can't argue with something that makes here even more beautiful.",
            "title": "My wife is looking great",
            "dateCreatedFormatted": "Nov 30, 2009",
            "purchaseDateFormatted": "",
            "name": "Lady O L"
        },
        "121895": {
            "id": 121895,
            "text": "I had bought this collagan booster for my face for wrinkles.  However, this amazing product helped reduce the severe pain in my back in two days time.  One night I forgot to take it and woke up the next morning in my usual pain. Using this product  has take away 90% of my pain  and now it is tolerable.",
            "title": "This product is amazing!",
            "dateCreatedFormatted": "Jun 20, 2009",
            "purchaseDateFormatted": "",
            "name": "Beverly V B"
        },
        "121909": {
            "id": 121909,
            "text": "I was using one of this companies other products and enjoyed it so much I made my wife try it.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-06-18<br \/>Thanks for the great advice, I started using this and I love it!<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-06-18<br \/>Your comment was so encouraging, that today I purchase my first bottle. Hopefull I will see the results and my husband will say the same about me as you've said about your wife. God bless you!<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-06-18<br \/>I just finished my fist bottle and I am getting my second asap, I see the improvement on my skin texture and my hair looks much better, I really think this is good product and you see results right away, I am 40.",
            "title": "My wife looks amazing",
            "dateCreatedFormatted": "Jun 1, 2009",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        }
    }
}