{
    "name": "Resveratrol with Active Trans-Resveratrol - 250 MG (60 Vegetarian Capsules)",
    "brand": "Reserveage Nutrition",
    "price": "42.6",
    "images": [
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_01?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_02?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_03?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_04?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_05?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_06?$OP_PDPZOOM$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_07?$OP_PDPZOOM$"
    ],
    "thumbnails": [
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_01?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_02?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_03?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_04?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_05?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_06?$OP_PLP$",
        "https:\/\/s7media.vitaminshoppe.com\/is\/image\/VitaminShoppe\/1703545_07?$OP_PLP$"
    ],
    "description": "<p>Pro-Longetivity Reservatrol Blend Designed to Support and Help:<\/p><ul><li>Activate the SIRT1 'longevity gene'*<\/li><li>Provide rapid cell rejuvenation*<\/li><li>Offer maximum antioxidant protection*<\/li><\/ul><p>*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.<\/p>",
    "feature": "Gluten Free,Vegan",
    "serving": "1 Capsule",
    "strength": "250 MG",
    "weight": "9",
    "weightType": "OZ",
    "upc": "094922978622",
    "numberOfServings": 60,
    "type": "",
    "form": "Vegetarian Capsules",
    "target": "",
    "ingredients": [
        {
            "ingredentDetails": "WILDCRAFTED JAPANESE KNOTWEED EXTRACT (POLYGONUM CUSPIDATUM) (ROOT AND RHIZOME) (STANDARDIZED TO CONTAIN 250 MG OF TRANS-RESVERATROL), ORGANIC FRENCH WHOLE RED WINE GRAPE (VITIS VINIFERA) (SKIN, SEEDS, FRUIT, STEM, VINE), CERTIFIED ORGANIC MUSCADINE WHOLE RED GRAPE (VITIS ROTUNDIFOLIA) (SKIN AND SEED)",
            "rdaPercnt": "*",
            "ingredentName": "PRO-LONGEVITY FACTORS BLEND:",
            "unts": "MG",
            "amtContained": "600",
            "sortOrder": "1"
        },
        {
            "ingredentDetails": "(AS QUERCETIN DIHYDRATE)",
            "rdaPercnt": "*",
            "ingredentName": "QUERCETIN",
            "unts": "MG",
            "amtContained": "100",
            "sortOrder": "2"
        }
    ],
    "otherIngredients": " Vegetarian capsule (vegetable cellulose), rice bran, silica.",
    "directions": " As a dietary supplement, take 1-2 capsules daily. Product can be taken on an empty stomach, with food or as recommended by your healthcare practitioner. Best stored tightly in a cool, dry place",
    "warnings": " Keep out of reach of children and pets. Do not use if outer seal is broken or missing. Please consult your healthcare professional before taking this product, especially if you are pregnant, nursing, on medication or under a doctor's care.",
    "allrgens": "Fish Free,Milk Free,Shellfish Free,Soy Free,Tree Nut Free,Wheat Free",
    "notContains": "Preservative Free, Free of Artificial Colors, Free of Artificial Flavors",
    "category": "Vitamins & Supplements",
    "subCategory1": "Supplements",
    "subCategory2": "Antioxidants",
    "reviews": {
        "774287": {
            "id": 774287,
            "text": "I love this super antioxidant that helps me look younger :)<br \/>I like that it gives me good energy.<br \/>I also like the size of the supplement which goes down easily.",
            "title": "Super Antioxidant",
            "dateCreatedFormatted": "Jun 15, 2024",
            "purchaseDateFormatted": "Nov 7, 2023",
            "name": "Kim G"
        },
        "274364": {
            "id": 274364,
            "text": "Although I can't tell a difference, I trust the source that recommended my supplement. It's what is in red wine grapes so I don't actually have to drink wine now to get the benefits. The source is a leading specialist on anti-ageing. That's good enough for me. I'm planning to take this for as long as I can.",
            "title": "Well Recommended",
            "dateCreatedFormatted": "Jul 13, 2021",
            "purchaseDateFormatted": "Jun 9, 2021",
            "name": "Margaret M"
        },
        "223342": {
            "id": 223342,
            "text": "Great product!",
            "title": "Reservage",
            "dateCreatedFormatted": "Aug 11, 2020",
            "purchaseDateFormatted": "Jun 25, 2020",
            "name": "Carolee P"
        },
        "219486": {
            "id": 219486,
            "text": "The quality of the Reserveage Resveratrol is excellent!  I highly recommend the product!",
            "title": "Resveratrol",
            "dateCreatedFormatted": "Jul 14, 2020",
            "purchaseDateFormatted": "Apr 16, 2020",
            "name": "CAROL F"
        },
        "219180": {
            "id": 219180,
            "text": "Great",
            "title": "Great",
            "dateCreatedFormatted": "Jul 12, 2020",
            "purchaseDateFormatted": "May 30, 2020",
            "name": "Rita A"
        },
        "187221": {
            "id": 187221,
            "text": "This product Resveratrol is very hard to find and when I researched on line and found that I could purchase it from The Vitamin Shoppe (TVS) with the required dosage and a larger quantity for less money I was very excited and immediately ordered it and the product was available in just a couple of days because it had to come from the TVS warehouse. The product is Outstanding",
            "title": "Outstanding Product, Highly Recommend it",
            "dateCreatedFormatted": "Nov 20, 2019",
            "purchaseDateFormatted": "Nov 12, 2019",
            "name": "Ina S"
        },
        "104751": {
            "id": 104751,
            "text": "couldnt take made me extremely sun sensitive.  Took weeks to get out of my system.",
            "title": "sun sensitivity",
            "dateCreatedFormatted": "Jun 6, 2013",
            "purchaseDateFormatted": "",
            "name": "tinker mom t"
        },
        "104738": {
            "id": 104738,
            "text": "I sure had high hopes in this product  I  did my research on it, and bought this brand after a Woman's health magazine had an article about this product.  I am one of the few who got the adverse side effects, like diahreah, pain in my legs and feet and a tingling sensation on my face and my blood pressure went up.  It could be that I am senstive to the ingredients.  I wish I had been one of the success stores.  So just be careful and monitor yourself and if you start to feel \"weird\" and different like I did,  stop taking.",
            "title": "Didnt work for me",
            "dateCreatedFormatted": "Nov 26, 2012",
            "purchaseDateFormatted": "",
            "name": "MrsG M"
        },
        "104744": {
            "id": 104744,
            "text": "Resveratrol 250 MG is GREAT! I've been taking this supplement for over six months. Your body feels great,you look and feel wonderful too. I was taking blood pressure medicine before taking these supplements.  After taking these supplements, it regulated my pressure and my doctor taken me off the blood pressure medication. Yes I would highly recommend this supplement.",
            "title": "GREAT!",
            "dateCreatedFormatted": "Aug 6, 2012",
            "purchaseDateFormatted": "",
            "name": "Gale G"
        },
        "104756": {
            "id": 104756,
            "text": "I love this product. It has helped me in many ways, in my over all health. Hair, skin, weightloss and just my over all well being. I have not tried other brands or VS brand because I have been satisfied with this brand. It's true you don't realize how much this stuff helps you until you stop taking it.",
            "title": "Genuine, Purchased and Used Product for 3yrs",
            "dateCreatedFormatted": "Mar 12, 2012",
            "purchaseDateFormatted": "",
            "name": "Donna L D"
        },
        "104743": {
            "id": 104743,
            "text": "Excellent product it really helped.",
            "title": "Great product",
            "dateCreatedFormatted": "Feb 6, 2012",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104741": {
            "id": 104741,
            "text": "After taking this product for 2 mos., my naturally thin hair has gotten thicker and is filling in my almost bald spot!!  I find that my memory and cognitive function have increased.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2011-12-28<br \/>RIDICULOUS - WAS THIS FROM THE MANUFACTURER???!<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2011-12-28<br \/>Uh, since when does resveratrol have any effect on hair loss???",
            "title": "Amazing Product!!",
            "dateCreatedFormatted": "Dec 1, 2011",
            "purchaseDateFormatted": "",
            "name": "TERRY B T"
        },
        "104752": {
            "id": 104752,
            "text": "I have been taking this product for over a year. I feel the difference if I have missed taking like if I run out. It has had no adverse effects on me but only great results. I do not know about the youthful return or anti-age property of this product though people have told me I look younger than my age. The thing I have found is after being diabetic for 10 years and taking 4 shots per day the product changed my life. After taking 1500 mg per day for 3 months, I was totally healed of diabetes. I have not had to take even one shot for over 10 months. This is the only product I can contribute the results to. I actually changed and bought a cheaper product from another store but immediately I started noticing my sugar count going up again. I went back to paying this high cost for this product but it brought my sugars back in line. I have recommended it to all the diabetics I run across.  Thanks and keep the quality as high as possible but please if you can vitamin shoppe, please bring the price of this product down. Not everyone in this world has a lot of money to spend on health items.",
            "title": "great results",
            "dateCreatedFormatted": "Oct 22, 2011",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104747": {
            "id": 104747,
            "text": "I have been using this product for a while and find it very useful.",
            "title": "Fantastic Product",
            "dateCreatedFormatted": "Oct 4, 2011",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104750": {
            "id": 104750,
            "text": "I tried some other brands and doses and this one seems the best. The biggest change in my health while taking Resveratrol is NO aches and pains on waking up. I have a lot of energy, my mood is good, I work 40 hours per week, sometimes on my feet 10 hours at 61 y\/o plus I am starting a small business evenings and weekends. The only other supplement that I can positively tell is helping me is 1000 mg of vitamin D. I have not had a cold in 2 years and my Cholesterol is normal, BP is 120\/70.",
            "title": "Helps me feel younger",
            "dateCreatedFormatted": "Jul 1, 2011",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104749": {
            "id": 104749,
            "text": "I am trying to buy as much organically as possible and was very happy to find this product. I am convinced of the value in taking resveratrol and extremely thrilled that this is organic.",
            "title": "Organic and I like it!",
            "dateCreatedFormatted": "Feb 20, 2011",
            "purchaseDateFormatted": "",
            "name": "MaryElise C M"
        },
        "104739": {
            "id": 104739,
            "text": "Both my husband and I wanted to give this brand of Resveratrol a try, we had been purchasing resveratrol before because we learned about its anti-aging benefits from an article, but now that we changed to this brand is when we started to see the difference, I am 36 and noticed that I had a lot more head hair growth, especially close to my forehead and closer to the neck, not that I was looking for it, but it was a difference. My husband also notices that his hair does not fall as often as before, I do think that he also has more hair, so he's very pleased with the product.",
            "title": "New hair!",
            "dateCreatedFormatted": "Sep 23, 2010",
            "purchaseDateFormatted": "",
            "name": "Rafael B R"
        },
        "104746": {
            "id": 104746,
            "text": "I only use Organic supplements and am very happy to find a company with the environmental ethics to use organic grapes.",
            "title": "Great Organic Product",
            "dateCreatedFormatted": "Aug 23, 2010",
            "purchaseDateFormatted": "",
            "name": "Organic L O"
        },
        "104740": {
            "id": 104740,
            "text": "When I went to buy this I thought it was an Organic product, but it is not at all. The logo on the front is not USDA and the company is luring customers with their name and made up logo. Seems there are a few milligrams of organic grape juice, but the resveratrol is not organic at all, what a sham stay away from this company<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2010-08-25<br \/>The ingredients on the back list the resveratrol as coming from certified organic grapes.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2010-08-25<br \/>From the Reservage website:",
            "title": "Mis Lead by Company",
            "dateCreatedFormatted": "Aug 17, 2010",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104757": {
            "id": 104757,
            "text": "Several months ago I woke up with swelling and pain in both hands. At first the pain and swelling would go away after a few minutes of using my hands in the morning, but then the swelling and pain began to last all day. I learned that these are classic symptoms of beginning rheumatoid arthritis (RA). My hand specialist confirmed that I probably have an immunological problem and we are waiting to see a rheumatologist for tests, but it will take several months to get an appointment. In the meantime, I noticed that after drinking several glasses of red wine one night, the next morning my hands were much less swollen and painful. Linking the red wine with resveratrol, I went on-line and read several testimonies where reseveratrol dramatically helped people with their symptoms of RA, so I decided to give it a try. I picked ReserveAge 250mg. I am taking one capsule twice a day and my hand pain and swelling has totally disappeared. I can wear my wedding ring again. I've been taking resveratrol for several weeks now and my hands feel fine. I have no negative side effects. If you are suffering from the effects of RA, please give resveratrol a try. It has worked for me.",
            "title": "Resveratrol helps with rheumatoid arthritis",
            "dateCreatedFormatted": "Feb 28, 2010",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104755": {
            "id": 104755,
            "text": "I had high hopes that this delivered all the benefits they claim. However, I had a dull headache and fatigue that would last almost the entire day after taking this. When I stopped taking it, the headaches stopped. Then when I tried it again, the headache and fatigue came back. Too bad. I think anyone who gets reactions to red wine may get the same reactions.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2010-04-04<br \/>I've had this also with resveratrol supplements and other supplements.  My view is that these are symptoms of detoxification, some of which have been extremely painful for me, depending on the suplement taken and  indicates an imbalance of some kind.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2010-04-04<br \/>I would agree this product made me sick, and turns out it is not organic at all, very misleading, stay away from this one",
            "title": "Horrible headaches and fatigue",
            "dateCreatedFormatted": "Feb 15, 2010",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104748": {
            "id": 104748,
            "text": "Since I began taking Reserveage products, I have noticed that I no longer pick up the colds my children bring home. While my house and office came down with the flu last month, I never got it. Great products.",
            "title": "Great flu protection",
            "dateCreatedFormatted": "Dec 4, 2009",
            "purchaseDateFormatted": "",
            "name": "Lady O L"
        },
        "104745": {
            "id": 104745,
            "text": "I have been on this product for about 2 months.  It is no better nor worse than others I have tried.  Resveratrol  products have no effect on me that I can tell.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-11-30<br \/>I have to disagree, I noticed a change within the first week and my wife noticed it within the first two weeks.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-11-30<br \/>That's strange, I noticed results in less than 1 month and noticed after about 4 months that I wasn't getting the colds that my children were bringing home from school.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-11-30<br \/>everyone has different responses to supplements for various reasons. Some do nothing for me also. I work with what works for me and move on.",
            "title": "No Difference",
            "dateCreatedFormatted": "Oct 28, 2009",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104754": {
            "id": 104754,
            "text": "I have been reading a lot about Resveratrol on the internet, but didn't want to get roped into one of those \"free trials\" that bills your credit card every month.  After a little more research and talking to one of the Vitamin Shoppe employees, I decided to give this product a try.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-11-30<br \/>I had a similar experience!",
            "title": "Pleasantly Surprised",
            "dateCreatedFormatted": "Aug 19, 2009",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104753": {
            "id": 104753,
            "text": "I have been using resveratrol for years. I decided to give this companies a try because it was less expensive and organic. There is a lot of good research out there on the benefits of using Organic products, if you haven't seen it I'd recommend looking some of it up.",
            "title": "The best Resveratrol product that I have tried",
            "dateCreatedFormatted": "Jul 24, 2009",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104737": {
            "id": 104737,
            "text": "I really love this companies products, in fact I have just ordered their new 500 (I normally take 2 250's a day). The only reason I don't click price is that its cheaper for me to buy the 500 mg.",
            "title": "This is a great product",
            "dateCreatedFormatted": "Jul 23, 2009",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        },
        "104736": {
            "id": 104736,
            "text": "Just started using it but the company is very accesible.. I like that !",
            "title": "Just started using it but ...",
            "dateCreatedFormatted": "Jun 27, 2009",
            "purchaseDateFormatted": "",
            "name": "Thomas M T"
        },
        "104742": {
            "id": 104742,
            "text": "My god daughter gave me a bottle of reserveage Resveratrol and IÕve been taking it for one month. After one week I started feeling better and felt like I had more energy. I know it sounds ridiculous, but it only took a week.<br \/><br \/>>> A Vitamin Shoppe Customer commented on this review on 2009-06-27<br \/>This is a Very Good Resveratrol.  Stay away from CHT Cellular Health Technologies Resveratrol...Or anything else they make.  The potency labels are inaccurate and the company CHT is impossible to contact. NO WEB SITE, NOPHONE# NOTHING. GET ReverseAge",
            "title": "It was a perfect gift",
            "dateCreatedFormatted": "May 5, 2009",
            "purchaseDateFormatted": "",
            "name": "A Vitamin Shoppe Customer A"
        }
    }
}